BearPi/BearPi-IoT_GD_GD32F303/BearPi-IoT_GD32F303_Demo_Suites/Projects/04_USART_Printf/main.c
/*!
    \file  main.c
    \brief USART printf demo
    
    \version 2019-10-30, V1.0.0, demo for BearPi-IoT_GD32F30x
*/

/*
    Copyright (c) 2019, BearPi LIMITED.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f30x.h"
#include "BearPi-IoT_gd32f303.h"
#include "systick.h"


void led_init(void);
void led_flash(int times);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    /* configure systick */
    systick_config();
	
		/* initialize the LED */
    gd_eval_led_init(LED);
	
    /* flash the LED for 1 time */
    led_flash(1);
    
    /* configure EVAL_COM0 */
    gd_eval_com_init(EVAL_COM0,115200);
    
    /* configure F1 key */
    gd_eval_key_init(F1_KEY, KEY_MODE_GPIO);
    
    /* output a message on hyperterminal using printf function */
    printf("\r\n USART printf example: please press the F1 KEY \r\n");
    
    /* wait for completion of USART transmission */
    while(RESET == usart_flag_get(EVAL_COM0, USART_FLAG_TC)){
    }
    while(1){
        /* check if the F1 key is pressed */
        if(RESET == gd_eval_key_state_get(F1_KEY)){
            delay_1ms(50);
            if(RESET == gd_eval_key_state_get(F1_KEY)){
                delay_1ms(50);
                if(RESET == gd_eval_key_state_get(F1_KEY)){
                    /* turn on LED */
                    gd_eval_led_on(LED);
                    /* output a message on hyperterminal using printf function */
                    printf("\r\n USART printf example \r\n");
                    /* wait for completion of USART transmission */
                    while(RESET == usart_flag_get(EVAL_COM0, USART_FLAG_TC)){
                    }
                }else{
                    /* turn off LED */
                    gd_eval_led_off(LED);
                }
            }else{
                /* turn off LED */
                gd_eval_led_off(LED);
            }
        }else{
            /* turn off LED */
            gd_eval_led_off(LED);
        }
    }
}



/*!
    \brief      flash the LED for test
    \param[in]  times: times to flash the LED
    \param[out] none
    \retval     none
*/
void led_flash(int times)
{
    int i;
    for(i=0; i<times; i++){
        /* delay 400 ms */
        delay_1ms(400);

        /* turn on LED */
        gd_eval_led_on(LED);

        /* delay 400 ms */
        delay_1ms(400);
			
        /* turn off LED */
        gd_eval_led_off(LED);

    }
}

